eewiki/psoc6_bootloader_advanced/main.c
/******************************************************************************
* File Name:   main.c
*
* Description: This is the source code for the Empty PSoC6 Application
*              for ModusToolbox.
*
* Related Document: See Readme.md
*
*******************************************************************************
* (c) 2019-2020, Cypress Semiconductor Corporation. All rights reserved.
*******************************************************************************
* This software, including source code, documentation and related materials
* ("Software"), is owned by Cypress Semiconductor Corporation or one of its
* subsidiaries ("Cypress") and is protected by and subject to worldwide patent
* protection (United States and foreign), United States copyright laws and
* international treaty provisions. Therefore, you may use this Software only
* as provided in the license agreement accompanying the software package from
* which you obtained this Software ("EULA").
*
* If no EULA applies, Cypress hereby grants you a personal, non-exclusive,
* non-transferable license to copy, modify, and compile the Software source
* code solely for use in connection with Cypress's integrated circuit products.
* Any reproduction, modification, translation, compilation, or representation
* of this Software except as specified above is prohibited without the express
* written permission of Cypress.
*
* Disclaimer: THIS SOFTWARE IS PROVIDED AS-IS, WITH NO WARRANTY OF ANY KIND,
* EXPRESS OR IMPLIED, INCLUDING, BUT NOT LIMITED TO, NONINFRINGEMENT, IMPLIED
* WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE. Cypress
* reserves the right to make changes to the Software without notice. Cypress
* does not assume any liability arising out of the application or use of the
* Software or any product or circuit described in the Software. Cypress does
* not authorize its products for use in any products where a malfunction or
* failure of the Cypress product may reasonably be expected to result in
* significant property damage, injury or death ("High Risk Product"). By
* including Cypress's product in a High Risk Product, the manufacturer of such
* system or application assumes all risk of such use and in doing so agrees to
* indemnify Cypress against all liability.
*******************************************************************************/
/******************************************************************************/
/*                                Includes                                    */
/******************************************************************************/
#include "cy_pdl.h"
#include "cyhal.h"
#include "cybsp.h"
#include "transport_ble.h"
#include "cy_retarget_io.h"
#include <stdio.h>


/******************************************************************************/
/*                                 Defines                                    */
/******************************************************************************/


/******************************************************************************/
/*                           Function Prototypes                              */
/******************************************************************************/
void AppCallBack(uint32_t event, void* eventParam);
void flashLED(cyhal_gpio_t led);
void IasEventHandler(uint32 event, void *eventParam);


/******************************************************************************/
/*                       Interrupt Service Routines                           */
/******************************************************************************/


/******************************************************************************/
/*                            Global Variables                                */
/******************************************************************************/
volatile uint8_t alertLevel;


/******************************************************************************/
/*                          Function Definitions                              */
/******************************************************************************/
/*******************************************************************************
* Function:     main
* Author:
* Description:    The entry point of the program.
* Date:         03-23-20
*******************************************************************************/
int main(void)
{
	cy_rslt_t           result;
	uint32_t            count;               // Used to count seconds
	cy_en_dfu_status_t  status;              // Status codes for DFU API
	uint32_t            state;               // DFU state
	const uint32_t      paramsTimeout = 20u; // Cy_DFU_Continue() timeout (ms)

	/* Buffer to store DFU commands */
	CY_ALIGN(4) static uint8_t buffer[CY_DFU_SIZEOF_DATA_BUFFER];

	/* Buffer for DFU data packets for transport API */
	CY_ALIGN(4) static uint8_t packet[CY_DFU_SIZEOF_CMD_BUFFER ];

	/* DFU params, used to configure DFU */
	cy_stc_dfu_params_t dfuParams;

	/* Unfreeze IO after Hibernate */
	if(Cy_SysPm_GetIoFreezeStatus())
	{
	    Cy_SysPm_IoUnfreeze();
	}
	/* Set SW2 as hibernate wakeup pin */
	Cy_SysPm_SetHibWakeupSource(CY_SYSPM_HIBPIN1_LOW);

	/* Initialize dfuParams structure */
	dfuParams.timeout          = paramsTimeout;
	dfuParams.dataBuffer       = &buffer[0];
	dfuParams.packetBuffer     = &packet[0];
	status = Cy_DFU_Init(&state, &dfuParams);

	/* Initialize the device and board peripherals */
	result = cybsp_init() ;
	if (result != CY_RSLT_SUCCESS)
	{
	    CY_ASSERT(0);
	}

	/* Initialize retarget-io to use the debug UART port */
	result = cy_retarget_io_init(CYBSP_DEBUG_UART_TX, CYBSP_DEBUG_UART_RX, CY_RETARGET_IO_BAUDRATE);
	if (result != CY_RSLT_SUCCESS)
	{
	    CY_ASSERT(0);
	}

	/* In the case of non-software reset and user does not want to stay in App0,
	 * check if there is a valid app image. If there is, switch to it.
	 */
	if (Cy_SysLib_GetResetReason() != CY_SYSLIB_RESET_SOFT)
	{
	    /* If Button held for 0.5 second - Switch to App1 if it is valid */
	    count = 10; // 50ms * 10 = 500ms
	    while ((Cy_GPIO_Read(PIN_SW2_PORT, PIN_SW2_PIN) == 0) && (count > 0))
	    {
	        count--;
	        Cy_SysLib_Delay(50);
	    }

	    /* Wait for user to release button and debounce*/
	    while (Cy_GPIO_Read(PIN_SW2_PORT, PIN_SW2_PIN) == 0);
	    Cy_SysLib_Delay(50);

	    if (count > 0)
	    {
	        status = Cy_DFU_ValidateApp(1u, &dfuParams);
	        if (status == CY_DFU_SUCCESS)
	        {
	            /* Clear reset reason */
	            do
	            {
	                Cy_SysLib_ClearResetReason();
	            } while(Cy_SysLib_GetResetReason() != 0);

	            Cy_DFU_ExecuteApp(1u); // Never returns
	        }
	    }
	}

	__enable_irq();

	flashLED(CYBSP_LED8);

