eewiki/psoc6_bootloader_advanced/main.c
	/* Initialize DFU communication */
	Cy_DFU_TransportStart();

	/* Registers the IAS CallBack. */
	alertLevel = 0;
	Cy_BLE_IAS_RegisterAttrCallback(IasEventHandler);

	count = 0;
	for(;;)
	{
		status = Cy_DFU_Continue(&state, &dfuParams);
		++count;
		if (state == CY_DFU_STATE_FINISHED)
		{
		   /* Finished loading the application image */
		   /* Validate DFU application, if it is valid then switch to it */
		   status = Cy_DFU_ValidateApp(1u, &dfuParams);
		   if (status == CY_DFU_SUCCESS)
		   {
		       Cy_DFU_TransportStop();
		       Cy_DFU_ExecuteApp(1u);
		   }
		   else if (status == CY_DFU_ERROR_VERIFY)
		   {
		       /*
		       * Restarts loading, an alternatives are to Halt MCU here
		       * or switch to the other app if it is valid.
		       * Error code may be handled here, i.e. print to debug UART.
		       */
		       status = Cy_DFU_Init(&state, &dfuParams);
		       Cy_DFU_TransportReset();
		   }
		}
		else if (state == CY_DFU_STATE_FAILED)
		{
		   /* An error has happened during the loading process */
		   /* Handle it here */
		   /* In this Code Example just restart loading process */
		   status = Cy_DFU_Init(&state, &dfuParams);
		   Cy_DFU_TransportReset();
		}
		else if (state == CY_DFU_STATE_UPDATING)
		{
		   uint32_t passed5seconds = (count >= (5000ul/paramsTimeout)) ? 1 : 0;
		   /*
		   * if no command has been received during 5 seconds when the loading
		   * has started then restart loading.
		   */
		   if (status == CY_DFU_SUCCESS)
		   {
		       count = 0u;
		   }
		   else if (status == CY_DFU_ERROR_TIMEOUT)
		   {
		       if (passed5seconds != 0u)
		       {
		           count = 0u;
		           Cy_DFU_Init(&state, &dfuParams);
		           Cy_DFU_TransportReset();
		       }
		   }
		   else
		   {
		       count = 0u;
		       /* Delay because Transport still may be sending error response to
		        * a host
		        */
		       Cy_SysLib_Delay(paramsTimeout);
		       Cy_DFU_Init(&state, &dfuParams);
		       Cy_DFU_TransportReset();
		   }
		}

		/* If SW2 pressed, switch to App1 if it is valid */
		if (Cy_GPIO_Read(PIN_SW2_PORT, PIN_SW2_PIN) == 0u)
		{
		   /* 50 ms delay for button debounce on button press */
		   Cy_SysLib_Delay(50u);
		   if (Cy_GPIO_Read(PIN_SW2_PORT, PIN_SW2_PIN) == 0u)
		   {
		       while (Cy_GPIO_Read(PIN_SW2_PORT, PIN_SW2_PIN) == 0u)
		       {   /* 50 ms delay for button debounce on button release */
		           Cy_SysLib_Delay(50u);
		       }
		       /* Validate and switch to App1 */
		       status = Cy_DFU_ValidateApp(1u, &dfuParams);
		       if (status == CY_DFU_SUCCESS)
		       {
		           Cy_DFU_TransportStop();
		           Cy_DFU_ExecuteApp(1u);
		       }
		   }
		}

		/* If alert level raised */
		if ( alertLevel != 0 )
		{
		    /* Validate and switch to App1 */
		    status = Cy_DFU_ValidateApp(1u, &dfuParams);
		    if (status == CY_DFU_SUCCESS)
		    {
		       Cy_DFU_TransportStop();
		       Cy_DFU_ExecuteApp(1u);
		    }
		}
	}
}


/*******************************************************************************
* Function:     Cy_OnResetUser
* Author:       Cypress Semiconductor
* Description:	  This function is called at the start of Reset_Handler(). DFU
*               requires it to call Cy_DFU_OnResetApp0() in app#0.
* Date:         05-20-19
*******************************************************************************/
void Cy_OnResetUser(void)
{
    Cy_DFU_OnResetApp0();
}


/*******************************************************************************
* Function:     flashLED
* Author:       Cypress Semiconductor (modified by Matt Mielke)
* Description:    This function initializes a timer/counter for PWM operation
*               sets a low output frequency and short duty cycle, causing the
*               LED to flash every second.
* Date:         03-23-20
*******************************************************************************/
void flashLED(cyhal_gpio_t led)
{
    cyhal_pwm_t pwm_led_control; // PWM object
    cy_rslt_t   result;          // API return code

    /* Initialize the TCPWM resource for PWM operation */
    result = cyhal_pwm_init(&pwm_led_control, led, NULL);
    if(result != CY_RSLT_SUCCESS)
    {
        CY_ASSERT(0);
    }

    /* Set the PWM output frequency and duty cycle */
    result = cyhal_pwm_set_duty_cycle(&pwm_led_control, 95, 1);
    if(result != CY_RSLT_SUCCESS)
    {
        CY_ASSERT(0);
    }

    /* Start the PWM */
    result = cyhal_pwm_start(&pwm_led_control);
    if(result != CY_RSLT_SUCCESS)
    {
        CY_ASSERT(0);
    }
}


/*******************************************************************************
* Function:     IasEventHandler
* Author:       Cypress Semiconductor
* Description:    This is an event callback function to receive events from the
*               BLE Component, which are specific to Immediate Alert Service.
* Date:         03-23-20
* Parameters:
*   event:       Write Command event from the BLE component.
*   eventParams: A structure instance of CY_BLE_GATT_HANDLE_VALUE_PAIR_T type
*******************************************************************************/
void IasEventHandler(uint32 event, void *eventParam)
{
    (void) eventParam;
    uint8_t alert;

    /* Alert Level Characteristic write event */
    if(event == CY_BLE_EVT_IASS_WRITE_CHAR_CMD)
    {
        /* Read the updated Alert Level value from the GATT database */
        Cy_BLE_IASS_GetCharacteristicValue(CY_BLE_IAS_ALERT_LEVEL, sizeof(alert), &alert);
        alertLevel = alert;
    }
}


/*******************************************************************************
* Function:     AppCallBack
* Author:       Cypress Semiconductor (modified by Matt Mielke)
* Description:    This is an event callback function to receive events from the
*               BLE Component. Used in Cy_DFU_TransportStart()
* Date:         03-23-20
*******************************************************************************/
void AppCallBack(uint32_t event, void* eventParam)
{
    cy_en_ble_api_result_t apiResult;

    static cy_stc_ble_gap_sec_key_info_t keyInfo =
    {
        .localKeysFlag    = CY_BLE_GAP_SMP_INIT_ENC_KEY_DIST |
                            CY_BLE_GAP_SMP_INIT_IRK_KEY_DIST |
                            CY_BLE_GAP_SMP_INIT_CSRK_KEY_DIST,
        .exchangeKeysFlag = CY_BLE_GAP_SMP_INIT_ENC_KEY_DIST |
                            CY_BLE_GAP_SMP_INIT_IRK_KEY_DIST |
                            CY_BLE_GAP_SMP_INIT_CSRK_KEY_DIST |
                            CY_BLE_GAP_SMP_RESP_ENC_KEY_DIST |
                            CY_BLE_GAP_SMP_RESP_IRK_KEY_DIST |
                            CY_BLE_GAP_SMP_RESP_CSRK_KEY_DIST,
    };

    switch(event)
    {
        /**********************************************************************
         * General events
         *********************************************************************/

        /* This event is received when the BLE stack is started */
        case CY_BLE_EVT_STACK_ON:
        {
            printf("[INFO] : BLE stack started\r\n");
            /* Enter into discoverable mode so that remote can search it. */
            apiResult = Cy_BLE_GAPP_StartAdvertisement(CY_BLE_ADVERTISING_FAST, 0u);
            if(CY_BLE_SUCCESS != apiResult)
            {
                printf("[ERROR] : Failed to start advertisement 0x%X\r\n", apiResult);
            }

            apiResult = Cy_BLE_GAP_GenerateKeys(&keyInfo);
            if(apiResult != CY_BLE_SUCCESS)
            {
                printf("[Error] : Generate Keys API 0x%X\r\n", apiResult);
            }
            break;
        }

        /* This event indicates that some internal HW error has occurred. */
        case CY_BLE_EVT_HARDWARE_ERROR:
        {
            printf("[INFO] : Hardware Error\r\n");
            break;
        }

         /* This event is received when there is a timeout */
        case CY_BLE_EVT_TIMEOUT:
        {
            /* Reason for Timeout */
            cy_en_ble_to_reason_code_t reason_code = ((cy_stc_ble_timeout_param_t*)eventParam)->reasonCode;

