eewiki/psoc6_bootloader_advanced/main.c
            switch(reason_code)
            {
                case CY_BLE_GAP_ADV_TO:
                {
                    printf("[INFO] : Advertisement timeout event\r\n");
                    break;
                }
                case CY_BLE_GATT_RSP_TO:
                {
                    printf("[INFO] : GATT response timeout\r\n");
                    break;
                }
                default:
                {
                    printf("[INFO] : BLE timeout event\r\n");
                    break;
                }
            }
            break;
        }

        /* This event indicates completion of Set LE event mask */
        case CY_BLE_EVT_LE_SET_EVENT_MASK_COMPLETE:
        {
            printf("[INFO] : Set LE mask event mask command completed\r\n");
            break;
        }

        /* This event indicates set device address command completed */
        case CY_BLE_EVT_SET_DEVICE_ADDR_COMPLETE:
        {
            printf("[INFO] : Set device address command has completed\r\n");
            break;
        }

        /* This event indicates set Tx Power command completed */
        case CY_BLE_EVT_SET_TX_PWR_COMPLETE:
        {
            printf("[INFO] : Set Tx power command completed\r\n");
            break;
        }

        /**********************************************************************
         * GAP events
         *********************************************************************/

        case CY_BLE_EVT_GAP_AUTH_REQ:
        {
            printf("[INFO] : GAP authentication request\r\n");
            if (cy_ble_configPtr->authInfo[CY_BLE_SECURITY_CONFIGURATION_0_INDEX].security
                == (CY_BLE_GAP_SEC_MODE_1 | CY_BLE_GAP_SEC_LEVEL_1))
            {
               cy_ble_configPtr->authInfo[CY_BLE_SECURITY_CONFIGURATION_0_INDEX].authErr =
                   CY_BLE_GAP_AUTH_ERROR_PAIRING_NOT_SUPPORTED;
            }

            cy_ble_configPtr->authInfo[CY_BLE_SECURITY_CONFIGURATION_0_INDEX].bdHandle =
               ((cy_stc_ble_gap_auth_info_t *)eventParam)->bdHandle;

            apiResult = Cy_BLE_GAPP_AuthReqReply(&cy_ble_configPtr->authInfo[CY_BLE_SECURITY_CONFIGURATION_0_INDEX]);
            if (apiResult != CY_BLE_SUCCESS)
            {
                printf("[ERROR] : Authentication Request Reply API 0x%X\r\n", apiResult);
            }
            break;
        }

        /* This event is triggered instead of 'CY_BLE_EVT_GAP_DEVICE_CONNECTED',
        * if Link Layer Privacy is enabled in component customizer
        */
        case CY_BLE_EVT_GAP_ENHANCE_CONN_COMPLETE:
        {
            printf("[INFO] : GAP enhanced connection complete\r\n");
            /* sets the security keys that are to be exchanged with a peer
             * device during key exchange stage of the authentication procedure
             */
            keyInfo.SecKeyParam.bdHandle =
                (*(cy_stc_ble_gap_enhance_conn_complete_param_t *)eventParam).bdHandle;

            apiResult = Cy_BLE_GAP_SetSecurityKeys(&keyInfo);
            if (apiResult != CY_BLE_SUCCESS)
            {
                printf("[ERROR] : Set Security Keys API 0x%X\r\n", apiResult);
            }
            break;
        }

        /* This event indicates security key generation complete */
        case CY_BLE_EVT_GAP_KEYS_GEN_COMPLETE:
        {
            printf("[INFO] : GAP key generation complete\r\n");
            keyInfo.SecKeyParam = (*(cy_stc_ble_gap_sec_key_param_t *)eventParam);
            Cy_BLE_GAP_SetIdAddress(&cy_ble_deviceAddress);
            break;
        }

        /* This event indicates SMP has completed pairing feature exchange */
        case CY_BLE_EVT_GAP_SMP_NEGOTIATED_AUTH_INFO:
        {
            printf("[INFO] : Pairing feature exchange complete\r\n");
            break;
        }

        /* This event is generated when disconnected from remote device or
         * failed to establish connection
         */
        case CY_BLE_EVT_GAP_DEVICE_DISCONNECTED:
        {
            printf("[INFO] : GAP device disconnected\r\n");
            /* Enter into discoverable mode so that remote can search it. */
            apiResult = Cy_BLE_GAPP_StartAdvertisement(CY_BLE_ADVERTISING_FAST, 0u);
            if(CY_BLE_SUCCESS != apiResult)
            {
                printf("[ERROR] : Failed to start advertisement 0x%X\r\n", apiResult);
            }

            break;
        }

        case CY_BLE_EVT_GAP_KEYINFO_EXCHNGE_CMPLT:
        {
            printf("[INFO] : GAP Key Info Exchange complete\r\n");
            break;
        }

        /* This event indicates GAP authentication complete */
        case CY_BLE_EVT_GAP_AUTH_COMPLETE:
        {
            printf("[INFO] : GAP Authentication complete\r\n");
            break;
        }

        /* This event indicates authentication process between two devices has
         * failed */
        case CY_BLE_EVT_GAP_AUTH_FAILED:
        {
            printf("[INFO] : GAP authentication failed 0x%X\r\n",
                    ((cy_stc_ble_gap_auth_info_t*)eventParam)->authErr);
            break;
        }

        /* This event indicates encryption is changed for an active connection */
        case CY_BLE_EVT_GAP_ENCRYPT_CHANGE:
        {
            printf("[INFO] : GAP encryption change complete\r\n");
            break;
        }

        /* This event is generated after connection parameter update is
         * requested from the host to the controller
         */
        case CY_BLE_EVT_GAP_CONNECTION_UPDATE_COMPLETE:
        {
            printf("[INFO] : GAP connection update complete\r\n");
            break;
        }

        /* This event indicates peripheral device has started/stopped
         *  advertising
         */
        case CY_BLE_EVT_GAPP_ADVERTISEMENT_START_STOP:
        {
            if(CY_BLE_ADV_STATE_ADVERTISING == Cy_BLE_GetAdvertisementState())
            {
                printf("[INFO] : BLE advertisement started\r\n");
            }
            else if (CY_BLE_ADV_STATE_STOPPED == Cy_BLE_GetAdvertisementState())
            {
                printf("[INFO] : BLE advertisement stopped\r\n");

                /* Fast and slow advertising period complete, go to low power
                 * mode (Hibernate mode) and wait for an external user event to
                 * wake up the device again
                 * */
                Cy_DFU_TransportStop(); // Stop DFU communication

