eewiki/psoc6_bootloader_advanced/main.c
                /* Check if app is valid, if it is then switch to it */
                uint32_t status = Cy_DFU_ValidateApp(1u, NULL);
                if (status == CY_DFU_SUCCESS)
                {
                    /* Clear reset reason because Cy_DFU_ExecuteApp() performs
                     * a software reset.
                     * Without clearing two reset reasons would be present.
                     */
                    do
                    {
                        Cy_SysLib_ClearResetReason();
                    } while(Cy_SysLib_GetResetReason() != 0);

                    Cy_DFU_ExecuteApp(1u); // Never returns
                }

                /* 300 seconds has passed and app is invalid. Hibernate */
                Cy_SysPm_Hibernate();
            }
            break;
        }

        /**********************************************************************
         * GATT events
         *********************************************************************/

        /* This event is generated at the GAP Peripheral end after connection
         * is completed with peer Central device
         */
        case CY_BLE_EVT_GATT_CONNECT_IND:
        {
            appConnHandle = *(cy_stc_ble_conn_handle_t *)eventParam;
            printf("[INFO] : GATT device connected\r\n");
            break;
        }

        /* This event is generated at the GAP Peripheral end after disconnection */
        case CY_BLE_EVT_GATT_DISCONNECT_IND:
        {
            printf("[INFO] : GATT device disconnected\r\n");
            break;
        }

        case CY_BLE_EVT_GATTS_WRITE_CMD_REQ:
        {
            printf("[INFO] : GATT write command request\r\n");
            break;
        }

        /* This event indicates that the 'GATT MTU Exchange Request' is received */
        case CY_BLE_EVT_GATTS_XCNHG_MTU_REQ:
        {
            printf("[INFO] : GATT MTU Exchange Request received\r\n");
            break;
        }

        /* This event received when GATT read characteristic request received */
        case CY_BLE_EVT_GATTS_READ_CHAR_VAL_ACCESS_REQ:
        {
            printf("[INFO] : GATT read characteristic request received for handle 0x%X\r\n",
                    (*(cy_stc_ble_gatts_char_val_read_req_t*)eventParam).attrHandle);
            break;
        }

        /***********************************************************************
        *                           Other Events                               *
        ***********************************************************************/
        default:
        {
            printf("[INFO] : BLE Event 0x%lX\r\n", (unsigned long) event);
        }
    }
}

/* [] END OF FILE */
